sglang/qwen-3.8/sglang-rtx-5090-qwen-3.8-27B-NVFP4-dspark-benchmark.txt
============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 3         
Successful requests:                     30        
Benchmark duration (s):                  77.75     
Total input tokens:                      184554    
Total input text tokens:                 184554    
Total generated tokens:                  11839     
Total generated tokens (retokenized):    11829     
Request throughput (req/s):              0.39      
Input token throughput (tok/s):          2373.55   
Output token throughput (tok/s):         152.26    
Peak output token throughput (tok/s):    398.00    
Peak concurrent requests:                4         
Total token throughput (tok/s):          2525.81   
Concurrency:                             2.89      
Accept length:                           3.85      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7478.12   
Median E2E Latency (ms):                 7828.63   
P90 E2E Latency (ms):                    9782.69   
P95 E2E Latency (ms):                    10908.01  
P99 E2E Latency (ms):                    11426.26  
---------------Time to First Token----------------
Mean TTFT (ms):                          5438.21   
Median TTFT (ms):                        5801.83   
P90 TTFT (ms):                           7607.38   
P95 TTFT (ms):                           8244.47   
P99 TTFT (ms):                           8403.97   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.15      
Median TPOT (ms):                        3.96      
P90 TPOT (ms):                           8.49      
P95 TPOT (ms):                           9.17      
P99 TPOT (ms):                           9.66      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           5.18      
Median ITL (ms):                         2.82      
P90 ITL (ms):                            9.97      
P95 ITL (ms):                            19.73     
P99 ITL (ms):                            19.98     
Max ITL (ms):                            20.97     
==================================================